battleship/app/controllers/api/v1/boards_controller.rb

  def index
    @boards = Board.all
---
SELECT "boards".* FROM "boards"